RIET/src/Documents/ЗагрузкаИРаспределениеРасходов/ЗагрузкаИРаспределениеРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаИРаспределениеРасходов</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Загрузка</name>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПерсонала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>FiscalType</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>Способ</name>
      <type>
        <types>CatalogRef.СпособыРаспределенияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>НалоговаяРегистрация</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСмит</name>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСтрокТВ</name>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalType</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеРучное</name>
    <attributes>
      <name>Способ</name>
      <type>
        <types>CatalogRef.СпособыРаспределенияРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распределять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ApInvoice</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PoNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ItemDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>URN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GltObjId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MgmtNIS_BLSummaryAcct</name>
      <comment>наименование счета Lawson</comment>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDesc</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/ЗагрузкаИРаспределениеРасходов/Forms/ФормаРасшифровки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// считаем параметры и сформируем отчет
	Если НЕ Параметры.Свойство("ТипРасшифровки") Тогда
		Закрыть();
	КонецЕсли;
	
	// ТипРасшифровки = "СтрокиТБ"
	// ТипРасшифровки = "Помойка"
	обновлениеПоКнопке = Ложь;
	Сформировать(Документы.ЗагрузкаИРаспределениеРасходов.ПолучитьМакетРасшифровки(Параметры.ТипРасшифровки));	
	ТипРасшифровки = Параметры.ТипРасшифровки;
	
КонецПроцедуры

&НаСервере
Процедура Сформировать(СхемаКомпоновкиДанных)
	
	//СКД = Документы.ЗагрузкаИРаспределениеРасходов.ПолучитьМакет("ОтборПоКонтрагенту");
	//
	//КомпоновщикНастроекОтбор.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	//КомпоновщикНастроекОтбор.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	
	СчетЛоусон 		= Неопределено;
	АУ 				= Неопределено;
	ФискалТайп  	= Неопределено;
	Локация 		= Неопределено;
	
	Если обновлениеПоКнопке Тогда 
		
		СчетЛоусон 		= СписокAccountLawson.ВыгрузитьЗначения();
		СписокAccountLawson.ЗагрузитьЗначения(СчетЛоусон);
		
		Если СписокFiscalType.Количество() > 0 Тогда
			ФискалТайп  	= СписокFiscalType.ВыгрузитьЗначения();
		КонецЕсли;
		
		Если СписокAU.Количество() > 0 Тогда
			АУ 				= СписокAU.ВыгрузитьЗначения();
		КонецЕсли;
		
		Если СписокЛокаций.Количество() > 0 Тогда
			Локация 		= СписокЛокаций.ВыгрузитьЗначения();
		КонецЕсли;
	 		
	Иначе
		
		СчетЛоусон 		= Параметры.AccountLawson;
		СписокAccountLawson.ЗагрузитьЗначения(СчетЛоусон);
		
		Если Параметры.Свойство("FiscalType") Тогда
			ФискалТайп  	= Параметры.FiscalType;
			СписокFiscalType.ЗагрузитьЗначения(ФискалТайп);
		КонецЕсли;
		
		Если Параметры.Свойство("AU") Тогда
			АУ 				= Параметры.AU;
			СписокAU.ЗагрузитьЗначения(АУ);
		КонецЕсли;
		
		Если Параметры.Свойство("Локация") Тогда
			Локация 		= Параметры.Локация;
			СписокЛокаций.ЗагрузитьЗначения(Локация);
		КонецЕсли;
	
	 	НачалоПериода 	= Параметры.НачалоПериода;
		КонецПериода 	= Параметры.КонецПериода;
		
	КонецЕсли;	
	
	Если НЕ обновлениеПоКнопке Тогда
	
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;	
		Адрес = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Адрес));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
		//ЭлОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрагентLawson"); 
		//ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		////ЭлОтбора.ПравоеЗначение = Значение; 
		//ЭлОтбора.Использование = Ложь;  // сначала отключим
		
		
	КонецЕсли;
	
	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки = КомпоновщикНастроек.Настройки;//СхемаКомпоновкиДанных.НастройкиПоУмолчанию; 
	
	// ставим параметры
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 	НачалоПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 	КонецПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("AccountLawson", 	СчетЛоусон);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьAU", 			НЕ (АУ 			= Неопределено));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьFiscalType", 	НЕ (ФискалТайп 	= Неопределено));
	Попытка
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьЛокация", 		НЕ (Локация		= Неопределено));
	Исключение
	КонецПопытки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("AU", 			АУ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("FiscalType", 	ФискалТайп);
	Попытка
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Локация", 		Локация);
	Исключение
	КонецПопытки;
	
		//Помещаем в переменную данные о расшифровке данных
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		
		//Формируем макет, с помощью компоновщика макета
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	
		//Передаем в макет компоновки схему, настройки и данные расшифровки
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		Настройки, ДанныеРасшифровки);
		
		//Выполним компоновку с помощью процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
		ДанныеРасшифровки);
	
	
	
	//Очищаем поле табличного документа
	ТабДок.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасшифровку(Команда)
	
	обновлениеПоКнопке = Истина;
	
	СформироватьНаСервере();
	
	обновлениеПоКнопке = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Сформировать(Документы.ЗагрузкаИРаспределениеРасходов.ПолучитьМакетРасшифровки(ТипРасшифровки));	
	
КонецПроцедуры
